tlt-tex-precompile.org
* Create a Precompiling Command for =LaTeX=
** A Note to Begin with
If you do not have the feeling that your document compiles faster even though you precompiled its preamble, check whether you use =latexmk=:
1. =org-mode= uses the command defined by  =org-latex-pdf-process=.
2. =TeX-mode= by default takes the first member of =TeX-command-list=.
If so, adjust the variables correspondingly; =latexmk= /does not support precompiled preambles/. 
** Defining the Precompiling Command 
First of all, we need to define the actual =LaTeX= command with which to precompile the preamble. This depends on the engine we use, so we will need to set that first. This is what =precompile-engine= is used for. By default, it is the same as that of =TeX-engine=. Since we need =precompile-engine= to be a string, we use =prin1-to-string= to get the string representation of =TeX-engine=. We also need the =-latex= form instead of the =-tex= form, e.g. =xelatex= instead of =xetex=. This is what =replace-regexp-in-string= is used for.

#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defcustom precompile-engine (replace-regexp-in-string "tex" "latex" (prin1-to-string TeX-engine))
    "Engine to run precompiling command with.")
#+END_SRC

The actual =LaTeX= command is created by =TeX-command=. It takes two arguments: a string and a function. The string is the name that is given to the =LaTeX= command to be executed. The connection between the string and the command is defined in =TeX-command-list=. It is a list whose members are arranged this way:

1. The name given to the =LaTeX= command.
2. A skeleton of the actual =LaTeX= shell command.
3. The function to run this command and its arguments
4. The modes in whose command menu the command should be shown.
5. A help string displayed when hovering over the command.

An example of such a list member is
#+BEGIN_SRC elisp :exports code
  ("LaTeX" "%`%l -shell-escape %(mode)%' %t" TeX-run-TeX nil
   (latex-mode doctex-mode)
   :help "Run LaTeX")
#+END_SRC
The admittedly quite cryptic second member contains several wildcards to be expanded; the expansion is done by =TeX-command-expand= on the basis of =TeX-expand-list= for strings wrapped in =%(= and =%)= and =TeX-expand-list-builtin= for letters preceded by =%=.

In order for our precompilation command to work, we need to create a similar list. This is what =precompile-list-item= is for. As it happens, the value of =-jobname= must be the same as the string at the beginning of the =.tex= file. I decided to hard-code this using the very common string "preamble".
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defvar precompile-command (format "%s -ini -interaction nonstopmode -shell-escape -jobname=\"preamble\" \"&%s\\dump\"" 
                                     precompile-engine (concat precompile-engine " %b"))
    "Command to run for precompiling the preamble.")

  (defvar precompile-list-item `("Precompiling" ,precompile-command TeX-run-precompile nil
                                 (plain-tex-mode latex-mode doctex-mode org-mode)
                                 :help "Precompile the preamble at hand for faster compiling.")
    "List for precompilation.")

#+END_SRC
** Other Variables
The preamble string is the name of the preamble file to be used for precompilation. By default, it is =preamble.tex=. 
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defcustom tlt-show-precompilation nil
    "Whether or not to show the output buffer of the precompilation."
    :group 'tlt)

  (defvar tlt-tex-precompile-process nil
    "Stores the precompilation process. 
    For internal use only.")

  (defvar preamble-string "preamble.tex")

  (defun preamble-string ()
    "Returns `preamble-string'."
    preamble-string)
#+END_SRC
* Searching for the Preamble
Often times, it is more convenient to precompile the preamble from the =.tex= or =.org= file you actually work in. Thus, we need a way to find the preamble. This is what =find-preamble= does. The idea is this:
1. Get the directory the current buffer's file is located in.
2. From that directory, get all sub-directories.
3. Search (non-recursively) for the preamble in the current directory and all of its sub-directories.
   1. If a preamble file is found,
      1. open it if =find-preamble= was called interactively using =M-x find-preamble= or a respective key-binding
      2. return its path if not called interactively.
   2. If a preamble file is not found
      1. signal a message if called interactively
      2. return an error if called non-interactively.
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defun find-preamble (&optional open base)
    "Assumes only one preamble to be in the directory or any of the subdirectories.
  If called interactively, open the preamble."
    (interactive "p")
    (let* ((dir (file-name-directory (buffer-file-name)))
           (dirfiles (directory-files dir))
           (subdirs 
            (-non-nil (mapcar 
                       (lambda (x) 
                         (when (and (file-directory-p x) 
                                    (not (member  x '("." ".."))))
                           x))
                       dirfiles)))
           (dirs (push dir subdirs))) ; dir appended so that if two preambles exist, the one in the current folder is selected

      (let ((value))
        (dolist (element dirs value)
          (when (file-exists-p (expand-file-name preamble-string element))
            (setq value element)))

        (cond 
       
         ((and value open)
          (find-file (expand-file-name preamble-string value))
          (if (member preamble-string dirfiles)
              (message "Preamble found in current directory.")
            (message "Preamble found in subdirectory \"%s/\"." value)))

         ((and (not value)  open)
          (message "No preamble found in the subdirectories or file directory."))

         ((and value (not open))
          (if base preamble-string (expand-file-name preamble-string value)))

         ((and (not value) (not open)) (error "No existing preamble found"))))
      ))
#+END_SRC
* Creating the Process
** Defining a Custom Sentinel
First of all, we need to create a process to be called. This is done by =TeX-run-command=. After the process was called, it must be killed again, possibly extracting some information to return to the user before. This is what =tlt-tex-precompile-preamble-sentinel= does. Specifically, the sentinel function checks whether problems with =fontspec=, =unicode-math=, =fontawesome= or any other =XeLaTeX=-related font-package arose. The command which makes sure that the process is created by =TeX-run-command= and killed by =tlt-tex-precompile-preamble-sentinel= is =TeX-run-precompile=.
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defun tlt-tex-precompile-preamble-sentinel (_process _name)
    "Cleanup TeX output buffer after running Biber."
    (goto-char (point-max))
    (let           ((binding (substitute-command-keys                                     ;  store the command bindings
                              "\\<tlt-TeX-utils-map>\\[tlt-tex-switch-to-precompilation-ouput]"))) ;  of the buffer switch command)
      (cl-letf (((symbol-function 'substitute-command-keys) (lambda (string &optional noface) binding)))

        (cond

         ((re-search-backward "exited abnormally\\|^Emergency stop\\|! I can't find file" nil t)
          (message (concat "TeX exited abnormally!"
                           "Type `%s' to display output.")
                   (substitute-command-keys
                    "\\<TeX-mode-map>\\[TeX-recenter-output-buffer]")))

         ((re-search-backward "! Can't \dump a format with native fonts or font-mappings." nil t)
          (message "Errors while recompiling! XeLaTeX can't handle native fonts. Remove fontspec and packages that depend on it from the preamble and recompile."))

         ((re-search-backward "^INFO - \\(WARNINGS\\|ERRORS\\): \\([0-9]+\\)" nil t)
          (message (concat "Precompilation finished with %s %s. "
                           "Type `%s' to display output.")
                   (match-string 2) (downcase (match-string 1))
                   (substitute-command-keys
                    "\\<TeX-mode-map>\\[TeX-recenter-output-buffer]"))
          (setq TeX-command-next TeX-command-default))

         ((re-search-backward "^FATAL" nil t)
          (message (concat "There was a fatal error during precompiling!"
                           "Type `%s' to display output.")
                   (substitute-command-keys
                    "\\<TeX-mode-map>\\[TeX-recenter-output-buffer]"))
          (setq TeX-command-next "Precompiling"))

         (t
          (message "Precompiling finished successfully! You can run TeX as usual now.")
          (setq TeX-command-next TeX-command-default))))))

  (defun TeX-run-precompile (name command file)
    "Create a process for NAME using COMMAND to precompile FILE.
          Return that process."
    (let ((process (TeX-run-command name command file)))
      (setq TeX-sentinel-function #'tlt-tex-precompile-preamble-sentinel)
      (if TeX-process-asynchronous
          process
        (TeX-synchronous-sentinel name file process))))
#+END_SRC
