el-files/tlt-tex-precompile.el
(defcustom precompile-engine (replace-regexp-in-string "tex" "latex" (prin1-to-string TeX-engine))
  "Engine to run precompiling command with.")

(defvar precompile-command (format "%s -ini -interaction nonstopmode -shell-escape -jobname=\"preamble\" \"&%s\\dump\"" 
                                   precompile-engine (concat precompile-engine " %b"))
  "Command to run for precompiling the preamble.")

(defvar precompile-list-item `("Precompiling" ,precompile-command TeX-run-precompile nil
                               (plain-tex-mode latex-mode doctex-mode org-mode)
                               :help "Precompile the preamble at hand for faster compiling.")
  "List for precompilation.")

(defcustom tlt-show-precompilation nil
  "Whether or not to show the output buffer of the precompilation."
  :group 'tlt)

(defvar tlt-tex-precompile-process nil
  "Stores the precompilation process. 
  For internal use only.")

(defvar preamble-string "preamble.tex")

(defun preamble-string ()
  "Returns `preamble-string'."
  preamble-string)

(defun find-preamble (&optional open base)
  "Assumes only one preamble to be in the directory or any of the subdirectories.
If called interactively, open the preamble."
  (interactive "p")
  (let* ((dir (file-name-directory (buffer-file-name)))
         (dirfiles (directory-files dir))
         (subdirs 
          (-non-nil (mapcar 
                     (lambda (x) 
                       (when (and (file-directory-p x) 
                                  (not (member  x '("." ".."))))
                         x))
                     dirfiles)))
         (dirs (push dir subdirs))) ; dir appended so that if two preambles exist, the one in the current folder is selected

    (let ((value))
      (dolist (element dirs value)
        (when (file-exists-p (expand-file-name preamble-string element))
          (setq value element)))

      (cond 

       ((and value open)
        (find-file (expand-file-name preamble-string value))
        (if (member preamble-string dirfiles)
            (message "Preamble found in current directory.")
          (message "Preamble found in subdirectory \"%s/\"." value)))

       ((and (not value)  open)
        (message "No preamble found in the subdirectories or file directory."))

       ((and value (not open))
        (if base preamble-string (expand-file-name preamble-string value)))

       ((and (not value) (not open)) (error "No existing preamble found"))))
    ))

(defun tlt-tex-precompile-preamble-sentinel (_process _name)
  "Cleanup TeX output buffer after running Biber."
  (goto-char (point-max))
  (let           ((binding (substitute-command-keys                                     ;  store the command bindings
                            "\\<tlt-TeX-utils-map>\\[tlt-tex-switch-to-precompilation-ouput]"))) ;  of the buffer switch command)
    (cl-letf (((symbol-function 'substitute-command-keys) (lambda (string &optional noface) binding)))

      (cond

       ((re-search-backward "exited abnormally\\|^Emergency stop\\|! I can't find file" nil t)
        (message (concat "TeX exited abnormally!"
                         "Type `%s' to display output.")
                 (substitute-command-keys
                  "\\<TeX-mode-map>\\[TeX-recenter-output-buffer]")))

       ((re-search-backward "! Can't \dump a format with native fonts or font-mappings." nil t)
        (message "Errors while recompiling! XeLaTeX can't handle native fonts. Remove fontspec and packages that depend on it from the preamble and recompile."))

       ((re-search-backward "^INFO - \\(WARNINGS\\|ERRORS\\): \\([0-9]+\\)" nil t)
        (message (concat "Precompilation finished with %s %s. "
                         "Type `%s' to display output.")
                 (match-string 2) (downcase (match-string 1))
                 (substitute-command-keys
                  "\\<TeX-mode-map>\\[TeX-recenter-output-buffer]"))
        (setq TeX-command-next TeX-command-default))

       ((re-search-backward "^FATAL" nil t)
        (message (concat "There was a fatal error during precompiling!"
                         "Type `%s' to display output.")
                 (substitute-command-keys
                  "\\<TeX-mode-map>\\[TeX-recenter-output-buffer]"))
        (setq TeX-command-next "Precompiling"))

       (t
        (message "Precompiling finished successfully! You can run TeX as usual now.")
        (setq TeX-command-next TeX-command-default))))))

(defun TeX-run-precompile (name command file)
  "Create a process for NAME using COMMAND to precompile FILE.
        Return that process."
  (let ((process (TeX-run-command name command file)))
    (setq TeX-sentinel-function #'tlt-tex-precompile-preamble-sentinel)
    (if TeX-process-asynchronous
        process
      (TeX-synchronous-sentinel name file process))))
