tlt-tex-precompile.org
** Handling Relative Paths in the Preamble
A big problem I was facing were relative paths used in the preamble command. Suppose you have the following line in there:
#+BEGIN_SRC latex :exports code
  \input{Configuration/macros.tex}
#+END_SRC
In addition, suppose that your preamble file is in the subdirectory =auxiliary files=. If you now run =tlt-tex-precompile-preamble=, the process's =default-directory= will be the main folder. Now you can, from there, issue the precompilation command -- the preamble will be found --, but the relative path will now pose a problem, since your shell will look for =Configuration/macros= /in your main folder/ and not in =auxiliary files=! You'll get the error that =Configuration/macros.tex= couldn't be found. 

To account for relative paths in the preamble, we need to have the default-directory set to the directory the preamble resides in. This is handled by =TeX-run-command=, which generates the process. The relevant line here is -- who would have thought --
#+BEGIN_SRC elisp :exports code
  (if dir (cd dir))
#+END_SRC
where =dir= is the /current/ buffer's directory. So we need to change the value of =dir=. =dir= itself is a variable locally bound by a =let= command:
#+BEGIN_SRC elisp :exports code
  (dir (TeX-master-directory))
#+END_SRC
Since =dir= is the value of =TeX-master-directory=, we will only need to change its function definition within =TeX-run-command= in such a way that it returns the right path -- the directory in which the preamble resides, or, in more technical terms, the value of =(file-name-directory (find-preamble))=.

Now =TeX-run-command= is also called in contexts in which we do not want to precompile a preamble, so blindly writing a function advice for =TeX-master-directory= would yield problems; we need to make sure that =TeX-master-directory= is changed only if we are precompiling a preamble. And for that we need a condition, which can be found further down the code: In order to correctly determine the =TeX= command to be run, we need to alter the parameter =%b= in =TeX-expand-list-builtin=. We do so by adding another entry to the list using =add-to-list=. Thus, this list entry is the first item (that is, the =car=) of =TeX-expand-list-builtin= if and only if we are running =tlt-tex-precompile-preamble= or, in other words, if and only if we are precompiling a preamble! Thus, our advise-funciton =directory-wrapper= looks like this:
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defun directory-wrapper (fun name command file)
    "Wrapper for `TeX-command-run' to change the process buffer's default directory."
    ;; If we are in the middle of a precompiling command, ;;

    (if (equal (car TeX-expand-list-builtin) '("%b" find-preamble nil t))

        ;; let `TeX-master-directory' return the preamble's path

        (flet ((TeX-master-directory () (file-name-directory (find-preamble))))
          (funcall fun name command file))

      ;; else just call `TeX-master-directory' unaltered

      (funcall fun name command file)))
#+END_SRC
* Precompiling the Preamble
** The Actual Command
The final interactive command to precompile the preamble is pretty straightforward now. Only a few notes are in order:
1. The modification of =TeX-expand-list-builtin= is the one we just used as a condition to create a suitable advice for =TeX-run-command=. It makes sure that the correct keys are shown for issuing =tlt-tex-switch-to-precompilation-output=.
2. =TeX-show-compilation= is replaced by =tlt-show-precompilation= for the users to decide themselves whether the output buffer of the precompilation command should be shown immediately.
3. =preamble-string= is given as the command to specify the path the the preamble. It always returns the value of the variable (!) =preamble-string=. This might sound wrong in the first place, but remember that we do not need a path since we =cd= in the preamble's folder with =TeX-run-command=.
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defun tlt-tex-precompile-preamble () 
    "Run biber on the `.tex' file corresponding to the current buffer's `.org' file and return process.
  If there is no such file, create it. If there is no `.bcf' file, ask for a LaTeX run first;
  see `tex-file-get-create'."
    (interactive)
    (let ((preamble (find-preamble)))

      (cond (preamble ; found

             (let* ((TeX-expand-list-builtin ; replace file name function in biber call
                     (add-to-list 'TeX-expand-list-builtin '("%b" find-preamble nil t))) ; prepending to list works; old entry further down is ignored
                    (TeX-show-compilation tlt-show-precompilation) ; own variable whether to show output directly
                    (TeX-command-sequence-max-runs-same-command 1) ; only run once
                    (pre-dir (file-name-directory preamble))
                                          ;  (default-directory pre-dir) ; change to directory the preamble is located in
                    (binding (substitute-command-keys                                     ;  store the command bindings
                              "\\<tlt-TeX-utils-map>\\[tlt-tex-switch-to-precompilation-output]"))) ;  of the buffer switch command
               (cl-letf (((symbol-function 'substitute-command-keys) (lambda (string &optional noface) binding))) ; and return it when `substitute-command-keys' is called

                 (setq tlt-tex-precompile-process (TeX-command "Precompiling" #'preamble-string))))) ; store the process returned to make it accessible later on

            ((called-interactively-p) (message "No preamble to compile was found.")) ; not found, interactive
            (t nil)))) ; not found, not interactive
#+END_SRC
** Consulting the Output Buffer
Now if the sentinel informed us that the precompilation did not finish as expected, we might want to inspect the exact error messages by having a look at the output command buffer. This is the task of =tlt-tex-switch-to-precompilation-output=.
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defun tlt-tex-switch-to-precompilation-output ()
    (interactive)
    "Display the buffer containing the output from the precompilation.
        Inform where the precompilation happened."
    (let* ((buf (process-buffer tlt-tex-precompile-process))
           (bufname (buffer-name buf))
           (strlist (split-string bufname "/" t nil))
           (names (last strlist 2))
           (filename (nth 1 names))
           (filename-finish (string-trim filename nil " output\\*"))
           (dirname (concat (nth 0 names) "/")))
      (prog1
          (message (format "Output from precompilation on %s in %s" filename-finish dirname))
        (display-buffer buf))))
#+END_SRC
** Tool-bar Button
To have our precompilation command available from the tool-bar, we will need to add the necessary information to =TeX-bar-TeX-button-alist= and =TeX-bar-LaTeX-button-alist=. This is what =precompile-button= is for. =tlt-precompile-button-tb= is a boolean variable to determine whether the precompilation command should be shown in the tool-bar.
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defvar precompile-button                      '(precompile :image "gv"
                                                              :command (tlt-tex-precompile-preamble)
                                                              :help (lambda (&rest ignored)
                                                                      (TeX-bar-help-from-command-list "Precompile your preamble"))))

  (defcustom tlt-precompile-button-tb t
    "Whether to add a precompilation button in the TeX-mode tool-bar.")
#+END_SRC
*  Make =org-mode= Support Precompiling
At this point, we have commands to find the preamble in question, precompile it, show errors after compilation and switch to the output buffer. In other words: Everything needed for /precompiling/ is arranged. Nonetheless, we have not yet dealt with actually /compiling/ a file using the precompiled preamble. 

For =LaTeX= to use the precompiled preamble, the =.tex= file needs to start with an expression of the form =%&preamble=. If we export from =.org= to =.tex=, though, the first lines are of this form:
#+BEGIN_SRC latex :exports code
  % Created [date] [weekday] [time in HH:MM]
  % Intended LaTeX compiler: [compiler]
#+END_SRC
Thus, we need to advice =org= to add =%&preamble= to any file which (1) is exported to =.tex= and (2) has a preamble floating around somewhere. =org-latex-template= returns the relevant template string, so we only need to advise this. Same spiel for =org-beamer-template=. This is what =tlt-preamble-template= does. The procedure is the following:

1. Check whether there is =preamble.fmt= in the main directory or any subdirectory.
   1. If there is, but its not =preamble.org=,
      1. move that preamble file to the =.org= document's directory
      2. export the current =.org= document without =\documentclass= but with =%&preamble=.
   2. If there is not, keep the =.org= file as-is; do nothing at all.
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defun tlt-preamble-template (fun contents info)
    (let* ((preamble-string "preamble.fmt") ; to not search for preamble.tex
           (preamble (condition-case nil ; condition-case handles error message
                         (find-preamble) ; find preamble.fmt
                       (error nil)))     ; return nil on error
(file (buffer-name))
           (dir (file-name-directory (buffer-file-name))))
      (if (and preamble (not (equal file "preamble.org"))) ; preamble shouldn't have features below
          ;; if there is preamble.fmt
          (progn
                                          ; move it in the main folder
            (rename-file preamble dir t)
            ;; add "%&preamble\n" and delete the documentclass definitoin
            (let ((template (funcall fun contents info)))
              (concat "%&preamble\n" 
                      (replace-regexp-in-string 
                       "\\\\documentclass\\[[^]]+]{[a-z 0-9]+}\n" "" template)))) ; delete \documentclass
        ;; else just call the function as-is
        (funcall fun contents info))))
#+END_SRC
