el-files/tlt-tex-precompile.el

(defun directory-wrapper (fun name command file)
  "Wrapper for `TeX-command-run' to change the process buffer's default directory."
  ;; If we are in the middle of a precompiling command, ;;

  (if (equal (car TeX-expand-list-builtin) '("%b" find-preamble nil t))

      ;; let `TeX-master-directory' return the preamble's path

      (flet ((TeX-master-directory () (file-name-directory (find-preamble))))
        (funcall fun name command file))

    ;; else just call `TeX-master-directory' unaltered

    (funcall fun name command file)))

(defun tlt-tex-precompile-preamble () 
  "Run biber on the `.tex' file corresponding to the current buffer's `.org' file and return process.
If there is no such file, create it. If there is no `.bcf' file, ask for a LaTeX run first;
see `tex-file-get-create'."
  (interactive)
  (let ((preamble (find-preamble)))

    (cond (preamble ; found

           (let* ((TeX-expand-list-builtin ; replace file name function in biber call
                   (add-to-list 'TeX-expand-list-builtin '("%b" find-preamble nil t))) ; prepending to list works; old entry further down is ignored
                  (TeX-show-compilation tlt-show-precompilation) ; own variable whether to show output directly
                  (TeX-command-sequence-max-runs-same-command 1) ; only run once
                  (pre-dir (file-name-directory preamble))
                                        ;  (default-directory pre-dir) ; change to directory the preamble is located in
                  (binding (substitute-command-keys                                     ;  store the command bindings
                            "\\<tlt-TeX-utils-map>\\[tlt-tex-switch-to-precompilation-output]"))) ;  of the buffer switch command
             (cl-letf (((symbol-function 'substitute-command-keys) (lambda (string &optional noface) binding))) ; and return it when `substitute-command-keys' is called

               (setq tlt-tex-precompile-process (TeX-command "Precompiling" #'preamble-string))))) ; store the process returned to make it accessible later on

          ((called-interactively-p) (message "No preamble to compile was found.")) ; not found, interactive
          (t nil)))) ; not found, not interactive

(defun tlt-tex-switch-to-precompilation-output ()
  (interactive)
  "Display the buffer containing the output from the precompilation.
      Inform where the precompilation happened."
  (let* ((buf (process-buffer tlt-tex-precompile-process))
         (bufname (buffer-name buf))
         (strlist (split-string bufname "/" t nil))
         (names (last strlist 2))
         (filename (nth 1 names))
         (filename-finish (string-trim filename nil " output\\*"))
         (dirname (concat (nth 0 names) "/")))
    (prog1
        (message (format "Output from precompilation on %s in %s" filename-finish dirname))
      (display-buffer buf))))

(defvar precompile-button                      '(precompile :image "gv"
                                                            :command (tlt-tex-precompile-preamble)
                                                            :help (lambda (&rest ignored)
                                                                    (TeX-bar-help-from-command-list "Precompile your preamble"))))

(defcustom tlt-precompile-button-tb t
  "Whether to add a precompilation button in the TeX-mode tool-bar.")

(defun tlt-preamble-template (fun contents info)
    (let* ((preamble-string "preamble.fmt") ; to not search for preamble.tex
           (preamble (condition-case nil ; condition-case handles error message
                         (find-preamble) ; find preamble.fmt
                       (error nil)))     ; return nil on error
(file (buffer-name))
           (dir (file-name-directory (buffer-file-name))))
      (if (and preamble (not (equal file "preamble.org"))) ; preamble shouldn't have features below
          ;; if there is preamble.fmt
          (progn
                                          ; move it in the main folder
            (rename-file preamble dir t)
            ;; add "%&preamble\n" and delete the documentclass definitoin
            (let ((template (funcall fun contents info)))
              (concat "%&preamble\n" 
                      (replace-regexp-in-string 
                       "\\\\documentclass\\[[^]]+]{[a-z 0-9]+}\n" "" template)))) ; delete \documentclass
        ;; else just call the function as-is
        (funcall fun contents info))))
