tlt-tex-precompile.org
* Adding a Tool-bar Entry
Once the precompiling command is added to =TeX-command-list=, a /menu bar/ entry is automatically created by =TeX-command-menu-entry=, which is run in =TeX-mode-specific-command-menu=. So there is no need to take care of this manually. Nonetheless, a /tool bar/ entry for precompiling is not added automatically. How this is done is already explained in [[*Tool-bar button][Tool-bar button]] already. To make sure the tool-bar is updated, =LaTeX-install-toolbar= and =TeX-install-toolbar= are added.
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defun tlt-tool-bar-toggle-precompile-button ()
    "Add/remove precompilation button to/from the tool-bar in TeX mode."
    (let ((button (assoc 'precompile TeX-bar-TeX-button-alist)))
                                          ; if the precompiling command is in the tool-bar, remove it
      (if button
          (progn  

            (setq TeX-bar-TeX-button-alist (delete precompile-button TeX-bar-TeX-button-alist))
            (setq TeX-bar-TeX-buttons (delete 'precompile TeX-bar-TeX-buttons))
            (setq TeX-bar-LaTeX-buttons (delete 'precompile TeX-bar-LaTeX-buttons))
            (LaTeX-install-toolbar)
            (TeX-install-toolbar))

                                          ; if it is not, add it
        (when tlt-precompile-button-tb
          (add-to-list 'TeX-bar-TeX-button-alist precompile-button t)) ; t for appending
        (add-to-list 'TeX-bar-TeX-buttons 'precompile t)
        (add-to-list 'TeX-bar-LaTeX-buttons 'precompile t)
        (LaTeX-install-toolbar)
        (TeX-install-toolbar)))

    nil)
#+END_SRC
** Reaping our Labor's Fruits
The commands below install and remove the functionality we just wrote the code for. With that, our package is finished!
#+BEGIN_SRC elisp :exports code :tangle el-files/tlt-tex-precompile.el
  (defun tlt-tex-install-precompiling ()
    (advice-add 'TeX-run-command :around #'directory-wrapper)
    (advice-add 'org-beamer-template :around #'tlt-preamble-template)
    (advice-add 'org-latex-template  :around #'tlt-preamble-template)
    (add-hook 'tool-bar-mode-hook #'tlt-tool-bar-toggle-precompile-button)
    (add-to-list 'TeX-command-list precompile-list-item t))

  (defun tlt-tex-uninstall-precompiling ()
    (advice-remove 'TeX-run-command #'directory-wrapper)
    (advice-remove 'org-beamer-template #'tlt-preamble-template)
    (advice-remove 'org-latex-template  #'tlt-preamble-template)
    (remove-hook 'tool-bar-mode-hook #'tlt-tool-bar-toggle-precompile-button)
    (setq TeX-command-list (delete precompile-list-item TeX-command-list)))

  (provide 'tlt-tex-precompile)

  ;; tlt-tex-precompile.el ends here ;;
#+END_SRC
* COMMENT rest
** Commands for precompiled preambles
Latexmk won't use precompiled preambles. For this reason, we're using a different command.
#+BEGIN_SRC elisp :exports code
  (defcustom xelatex-fast '("xelatex fast" "xelatex -file-line-error --synctex=1 -shell-escape  -interaction=nonstopmode %b" TeX-run-interactive nil
                            (plain-tex-mode latex-mode doctex-mode org-mode)
                            :help "Run a quick xelatex command.")

    (add-to-list 'TeX-command-list xelatex-fast t)
    "Fast xelatex command.")

                                          ; Wenn .bcf existiert, biber + xelatex fast
                                          ; sonst xelatex fast + biber + xelatex fast
  (TeX-command-sequence '("Biber" "xelatex fast"))
#+END_SRC

