el-files/tlt-tex-precompile.el

(defun tlt-tool-bar-toggle-precompile-button ()
  "Add/remove precompilation button to/from the tool-bar in TeX mode."
  (let ((button (assoc 'precompile TeX-bar-TeX-button-alist)))
                                        ; if the precompiling command is in the tool-bar, remove it
    (if button
        (progn  

          (setq TeX-bar-TeX-button-alist (delete precompile-button TeX-bar-TeX-button-alist))
          (setq TeX-bar-TeX-buttons (delete 'precompile TeX-bar-TeX-buttons))
          (setq TeX-bar-LaTeX-buttons (delete 'precompile TeX-bar-LaTeX-buttons))
          (LaTeX-install-toolbar)
          (TeX-install-toolbar))

                                        ; if it is not, add it
      (when tlt-precompile-button-tb
        (add-to-list 'TeX-bar-TeX-button-alist precompile-button t)) ; t for appending
      (add-to-list 'TeX-bar-TeX-buttons 'precompile t)
      (add-to-list 'TeX-bar-LaTeX-buttons 'precompile t)
      (LaTeX-install-toolbar)
      (TeX-install-toolbar)))

  nil)

(defun tlt-tex-install-precompiling ()
  (advice-add 'TeX-run-command :around #'directory-wrapper)
  (advice-add 'org-beamer-template :around #'tlt-preamble-template)
  (advice-add 'org-latex-template  :around #'tlt-preamble-template)
  (add-hook 'tool-bar-mode-hook #'tlt-tool-bar-toggle-precompile-button)
  (add-to-list 'TeX-command-list precompile-list-item t))

(defun tlt-tex-uninstall-precompiling ()
  (advice-remove 'TeX-run-command #'directory-wrapper)
  (advice-remove 'org-beamer-template #'tlt-preamble-template)
  (advice-remove 'org-latex-template  #'tlt-preamble-template)
  (remove-hook 'tool-bar-mode-hook #'tlt-tool-bar-toggle-precompile-button)
  (setq TeX-command-list (delete precompile-list-item TeX-command-list)))

(provide 'tlt-tex-precompile)

;; tlt-tex-precompile.el ends here ;;
